app/controllers/students_controller.rb

  def create
    @student = Student.create(post_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2017-08-14 20:29:06.490628"], ["updated_at", "2017-08-14 20:29:06.490628"]]

  def update
    @student = Student.find(params[:id])
    @student.update(post_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2017-08-14 21:30:20.588662"], ["id", 1]]